app/controllers/beauty_and_sex_controller.rb

SELECT "beauty_and_sexes".* FROM "beauty_and_sexes"
---
  def index
    @beauty_and_sex = BeautyAndSex.all