app/controllers/news_controller.rb

    def index
      @news = news_type_class.all.reverse#.order("created_at DESC")
      if params[:search]
        @news = News.search(params[:search]).order("created_at DESC")
---
SELECT "news".* FROM "news" WHERE (description ILIKE '%Myntra%')  ORDER BY created_at DESC